Repository: MidnightCrowing/KeyPocket
Catalog: KeyPocket.UI/Strings/*/Resources.resw
Source language: en_us
Languages: zh_tw

# Shell_SearchBox.PlaceholderText
source: Search..
zh_tw: 搜尋..

# Shell_Home.Content
source: Home
zh_tw: 首頁

# Shell_Models.Content
source: Models
zh_tw: 模型

# Shell_Keys.Content
source: Keys
zh_tw: 金鑰

# Shell_Providers.Content
source: Providers
zh_tw: 服務商

# Shell_AddProvider.Content
source: Add Provider
zh_tw: 新增服務商

# Settings_Title.Text
source: Settings
zh_tw: 設定

# Settings_Appearance.Text
source: Appearance
zh_tw: 外觀

# Settings_Language.Header
source: Language
zh_tw: 語言

# Settings_Language.Description
source: Select application language
zh_tw: 選擇應用程式語言

# Settings_Language_Auto.Content
source: Use system setting
zh_tw: 跟隨系統

# Settings_Language_En.Content
source: English
zh_tw: 英語 (English)

# Settings_Language_Zh.Content
source: Simplified Chinese
zh_tw: 簡體中文

# Settings_Language_ZhTw.Content
source: Traditional Chinese
zh_tw: 繁體中文

# Settings_Theme.Header
source: App theme
zh_tw: 應用程式主題

# Settings_Theme.Description
source: Select which app theme to display
zh_tw: 選擇要顯示的應用程式主題

# Settings_Theme_Light.Content
source: Light
zh_tw: 淺色

# Settings_Theme_Dark.Content
source: Dark
zh_tw: 深色

# Settings_Theme_System.Content
source: Use system setting
zh_tw: 跟隨系統

# Settings_ExchangeRates.Text
source: Exchange Rates
zh_tw: 匯率

# Settings_DisplayCurrency.Header
source: Display Currency
zh_tw: 顯示貨幣

# Settings_DisplayCurrency.Description
source: Set default display currency
zh_tw: 設定預設顯示貨幣

# Settings_ExchangeRateDetails.Header
source: Exchange Rate Details
zh_tw: 匯率詳情

# Settings_ExchangeRateDetails.Description
source: Configure exchange rates between currencies
zh_tw: 設定貨幣之間的匯率

# Settings_AddExchangeRate.Text
source: Add Exchange Rate
zh_tw: 新增匯率

# Settings_AddRate_From.PlaceholderText
source: From
zh_tw: 從 (來源貨幣)

# Settings_AddRate_To.PlaceholderText
source: To
zh_tw: 到 (目標貨幣)

# Settings_AddRate_Rate.PlaceholderText
source: Rate
zh_tw: 匯率

# Settings_About.Text
source: About
zh_tw: 關於

# Settings_Resources.Header
source: Resources & Sources
zh_tw: 資源與來源

# Settings_License.Header
source: License
zh_tw: 授權條款

# Settings_IconLink.Content
source: AI / LLM Model Icon
zh_tw: AI / LLM 模型圖示

# Models_Provider_EditTooltip.ToolTipService.ToolTip
source: Double click to edit provider settings
zh_tw: 雙擊編輯服務商設定

# Models_SearchBox.PlaceholderText
source: Search models...
zh_tw: 搜尋模型...

# Models_Capability.Text
source: Capability:
zh_tw: 能力:

# Models_SortBy.Text
source: Sort by:
zh_tw: 排序:

# Models_Favorites.ToolTipService.ToolTip
source: Favorites
zh_tw: 收藏

# Models_Tag_Chat.Text
source: Chat
zh_tw: 對話

# Models_Tag_Embedding.Text
source: Embedding
zh_tw: 嵌入

# Models_Price_In.Text
source: In:
zh_tw: 輸入:

# Models_Price_Out.Text
source: Out:
zh_tw: 輸出:

# Models_CopyID.ToolTipService.ToolTip
source: Copy ID
zh_tw: 複製 ID

# Keys_SearchBox.PlaceholderText
source: Search tags...
zh_tw: 搜尋標籤...

# Keys_SortBy.Text
source: Sort by:
zh_tw: 排序:

# Keys_Favorites.ToolTipService.ToolTip
source: Favorites
zh_tw: 收藏

# Keys_MaskedKey.ToolTipService.ToolTip
source: API Key (Masked)
zh_tw: API 金鑰 (已遮蔽)

# Keys_Tag.PlaceholderText
source: Tag
zh_tw: 標籤

# Keys_CopyKey.ToolTipService.ToolTip
source: Copy Key
zh_tw: 複製金鑰

# Home_NoProviders.Text
source: No Providers Configured
zh_tw: 尚未配置服務商

# Home_AddFirstProvider.Content
source: Add Your First Provider
zh_tw: 新增你的第一個服務商

# Home_Disclaimer.Title
source: Disclaimer
zh_tw: 免責聲明

# Home_Disclaimer.Message
source: This is not a professional key management solution. If you have professional security requirements, please use dedicated password managers or enterprise key management systems.
zh_tw: 本軟體並非專業的金鑰管理解決方案。如果您有專業的安全需求,請使用專業的密碼管理器或企業級金鑰管理系統。

# ProviderSettings_Title.Text
source: Provider Settings
zh_tw: 服務商設定

# ProviderSettings_Subtitle.Text
source: Manage your provider details, API keys, and model configurations.
zh_tw: 管理服務商詳情、API 金鑰和模型設定。

# ProviderSettings_General.Text
source: General
zh_tw: 一般

# ProviderSettings_GeneralDesc.Text
source: Basic provider information.
zh_tw: 服務商基本資訊。

# ProviderSettings_Name.Text
source: Name
zh_tw: 名稱

# ProviderSettings_Icon.Text
source: Icon
zh_tw: 圖示

# ProviderSettings_Presets.Content
source: Presets
zh_tw: 預設

# ProviderSettings_Browse.Content
source: Browse...
zh_tw: 瀏覽...

# ProviderSettings_RemoveIcon.Content
source: Remove Icon
zh_tw: 移除圖示

# ProviderSettings_BaseUrlDesc.Text
source: The base URL of the API provider.
zh_tw: API 服務商的存取基底位址。

# ProviderSettings_ApiMode.Text
source: API Mode
zh_tw: API 模式

# ProviderSettings_ProviderCurrency.Text
source: Provider Currency
zh_tw: 結算貨幣

# ProviderSettings_ProviderCurrencyDesc.Text
source: The currency used by this provider for billing.
zh_tw: 該服務商使用的計費貨幣。

# ProviderSettings_Description.Text
source: Description
zh_tw: 描述

# ProviderSettings_Save.Content
source: Save Changes
zh_tw: 儲存變更

# ProviderSettings_ApiKeys.Text
source: API Keys
zh_tw: API 金鑰

# ProviderSettings_ApiKeysDesc.Text
source: Manage access keys for this provider.
zh_tw: 管理此服務商的存取金鑰。

# ProviderSettings_AddApiKey.Content
source: Add API Key
zh_tw: 新增 API 金鑰

# ProviderSettings_Confirm.Content
source: Confirm
zh_tw: 確認

# ProviderSettings_Cancel.Content
source: Cancel
zh_tw: 取消

# ProviderSettings_ApiKeyPlaceholder.PlaceholderText
source: Enter API Key (sk-...)
zh_tw: 輸入 API 金鑰 (sk-...)

# ProviderSettings_Models.Text
source: Models
zh_tw: 模型

# ProviderSettings_ModelsDesc.Text
source: Configure available models.
zh_tw: 設定可用模型。

# ProviderSettings_Import.Content
source: Import
zh_tw: 匯入

# ProviderSettings_ImportFromCsv.Text
source: Import from CSV
zh_tw: 從 CSV 匯入

# ProviderSettings_CreateCsvTemplate.Text
source: Create CSV Template
zh_tw: 建立 CSV 範本

# ProviderSettings_AddModel.Content
source: Add Model
zh_tw: 新增模型

# ProviderSettings_FetchModels.Content
source: Fetch Models
zh_tw: 獲取模型

# ProviderSettings_FetchModels.ToolTipService.ToolTip
source: Fetch available models from provider
zh_tw: 從服務商獲取可用模型列表

# ProviderSettings_DangerZone.Text
source: Danger Zone
zh_tw: 危險區域

# ProviderSettings_DeleteProvider.Text
source: Delete this provider
zh_tw: 刪除此服務商

# ProviderSettings_DeleteProviderDesc.Text
source: Once you delete a provider, there is no going back. Please be certain.
zh_tw: 一旦刪除服務商，將無法恢復。請謹慎操作。

# ProviderSettings_DeleteProviderButton.Content
source: Delete this provider
zh_tw: 刪除此服務商

# ProviderSettings_ModelId.Text
source: Model ID
zh_tw: 模型 ID

# ProviderSettings_ModelIdPlaceholder.PlaceholderText
source: e.g. gpt-4
zh_tw: 例如 gpt-4

# ProviderSettings_ModelName.Text
source: Display Name (Optional)
zh_tw: 顯示名稱 (可選)

# ProviderSettings_ModelNamePlaceholder.PlaceholderText
source: e.g. GPT-4
zh_tw: 例如 GPT-4

# ProviderSettings_InputPrice.Text
source: Input Price (per M tokens)
zh_tw: 輸入價格 (每百萬 tokens)

# ProviderSettings_InputPricePlaceholder.PlaceholderText
source: e.g. 0.03
zh_tw: 例如 0.03

# ProviderSettings_OutputPrice.Text
source: Output Price (per M tokens)
zh_tw: 輸出價格 (每百萬 tokens)

# ProviderSettings_OutputPricePlaceholder.PlaceholderText
source: e.g. 0.06
zh_tw: 例如 0.06

# ProviderSettings_AddTag.ToolTipService.ToolTip
source: Add Tag
zh_tw: 新增標籤

# ProviderSettings_EditTag.ToolTipService.ToolTip
source: Click to edit tag
zh_tw: 點擊編輯標籤

# ProviderSettings_Favorite.ToolTipService.ToolTip
source: Favorite
zh_tw: 收藏

# ProviderSettings_Delete.ToolTipService.ToolTip
source: Delete
zh_tw: 刪除

# ProviderSettings_CopyModelID.ToolTipService.ToolTip
source: Copy Model ID
zh_tw: 複製模型 ID

# ProviderSettings_Edit.ToolTipService.ToolTip
source: Edit
zh_tw: 編輯

# ProviderSettings_DeleteDialog_Title
source: Delete Provider
zh_tw: 刪除服務商

# ProviderSettings_DeleteDialog_Content
source: Are you sure you want to delete this provider? This action cannot be undone.
zh_tw: 您確定要刪除此服務商嗎？此操作無法撤銷。

# ProviderSettings_DeleteDialog_PrimaryButton
source: Delete
zh_tw: 刪除

# ProviderSettings_DeleteDialog_CloseButton
source: Cancel
zh_tw: 取消

# Settings_RestartRequired.Text
source: Restart required to apply changes
zh_tw: 重新啟動應用程式後生效

# ProviderSettings_ModelInputPriceLabel.Text
source: In:
zh_tw: 輸入:

# ProviderSettings_ModelOutputPriceLabel.Text
source: Out:
zh_tw: 輸出:

# Models_Filter_Title.Text
source: Filters
zh_tw: 篩選

# Models_Filter_Reset.Content
source: Reset
zh_tw: 重置

# Models_Filter_Capability.Text
source: Capability
zh_tw: 能力

# Models_Filter_Pricing.Text
source: Prompt Pricing
zh_tw: 提示詞價格

# Models_Filter_Price_Free.Text
source: Free
zh_tw: 免費

# Models_Filter_Status.Text
source: Status
zh_tw: 狀態

# Models_Filter_FavoritesOnly.Content
source: Show favorites only
zh_tw: 僅顯示收藏

# Models_Sort_NameAsc.Text
source: Name (A-Z)
zh_tw: 名稱 (A-Z)

# Models_Sort_NameDesc.Text
source: Name (Z-A)
zh_tw: 名稱 (Z-A)

# Models_Sort_PriceLow.Text
source: Pricing: Low to High
zh_tw: 價格: 從低到高

# Models_Sort_PriceHigh.Text
source: Pricing: High to Low
zh_tw: 價格: 從高到低

# Models_Segment_Text.ToolTipService.ToolTip
source: Text/Chat models
zh_tw: 文本/對話模型

# Models_Segment_File.ToolTipService.ToolTip
source: File processing models
zh_tw: 檔案處理模型

# Models_Segment_Image.ToolTipService.ToolTip
source: Image models
zh_tw: 圖像模型

# Models_Segment_Audio.ToolTipService.ToolTip
source: Audio models
zh_tw: 音訊模型

# Models_Segment_Video.ToolTipService.ToolTip
source: Video models
zh_tw: 影片模型

# Models_Segment_Embeddings.ToolTipService.ToolTip
source: Embedding models
zh_tw: 嵌入模型

# Models_List_Provider.Content
source: Provider
zh_tw: 服務商

# Models_List_ModelName.Content
source: Model Name
zh_tw: 模型名稱

# Models_Card_By.Text
source: by
zh_tw: 來自

# Models_Card_In.Text
source: In:
zh_tw: 輸入:

# Models_Card_Out.Text
source: Out:
zh_tw: 輸出:

# Models_InputPriceFormat
source: Input ({0}/1M)
zh_tw: 輸入 ({0}/1M)

# Models_OutputPriceFormat
source: Output ({0}/1M)
zh_tw: 輸出 ({0}/1M)

# ProviderSettings_Tags.Text
source: Tags
zh_tw: 標籤

# ProviderSettings_TagsPlaceholder.PlaceholderText
source: Select tags...
zh_tw: 選擇標籤...

# Models_CountFormat
source: {0} models
zh_tw: {0} 個模型
